Revit 2024 API
Application.OpenDocumentFile Method
Overload List
Name | Description
OpenDocumentFile(String)
 Opens a document from disk.
OpenDocumentFile(ModelPath, OpenOptions)
 Opens a document from disk or cloud.
OpenDocumentFile(ModelPath, OpenOptions, IOpenFromCloudCallback)
 Opens a document from disk or cloud.
See Also
Application Class
Application Members
Autodesk.Revit.ApplicationServices Namespace